//KC03CABE JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID         
//JOBLIB  DD  DSN=DSND10.SDSNLOAD,DISP=SHR                              
//        DD DSN=KC03CAB.CURSOS.PGMLIB,DISP=SHR                         
//*                                                                     
//*******************************************                           
//*  ELIMINADO DE ARCHIVO FBA GENERADO      *                           
//*******************************************                           
//*                                                                     
//STEP1     EXEC PGM=IDCAMS,COND=(8,LT)                                 
//SYSPRINT  DD SYSOUT=*                                                 
//SYSIN     DD *                                                        
     DELETE   KC03CAB.PGMB7CAB.CLIENTES                                 
     SET MAXCC = 0                                                      
//*                                                                     
//*******************************************                           
//*  EJECUCION DE PGM COBOL CON SQL | DB2   *                           
//*******************************************                           
//*                                                                     
//STEP2    EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                    
//SYSTSPRT DD SYSOUT=*                                                  
//CLIENTES DD DSN=KC03CAB.PGMB7CAB.CLIENTES,UNIT=SYSDA,                 
//            DCB=(LRECL=133,BLKSIZE=1330,RECFM=FBA),                   
//            SPACE=(TRK,(1,1),RLSE),DISP=(NEW,CATLG,CATLG)             
//SYSOUT   DD SYSOUT=*                                                  
//SYSTSIN  DD *                                                         
  DSN SYSTEM(DBDG)                                                      
  RUN  PROGRAM(PGMB7CAB) PLAN(CURSOCAB) +                               
      LIB('KC03CAB.CURSOS.PGMLIB')                                      
  END                                                                   
//SYSPRINT DD SYSOUT=*                                                  
//SYSUDUMP DD SYSOUT=*                                                  
//SYSIN    DD *                                                         
//*                                                                     
//                                                                      