//KC03CABB JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID         
//JOBLIB   DD  DSN=DSND10.SDSNLOAD,DISP=SHR                             
//STEP1   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     
//*
//****************************************************                  
//*  JCL DE BINDEO DE PGM COBOL CON SQL EMBEBIDO     *                  
//****************************************************                  
//*
//DBRMLIB  DD  DSN=KC03CAB.CURSOS.DBRMLIB,DISP=SHR                      
//SYSTSPRT DD SYSOUT=*                                                  
//SYSTSIN  DD *                                                         
  DSN SYSTEM(DBDG)                                                      
  RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA13) -                                
       LIB('DSND10.DBDG.RUNLIB.LOAD')                                   
  BIND PLAN(CURSOCAB) MEMBER('NOMBRE PGM COBOL') +                                
      CURRENTDATA(NO) ACT(REP) ISO(CS) ENCODING(EBCDIC)                 
  END                                                                   
//SYSPRINT DD SYSOUT=*                                                  
//SYSUDUMP DD SYSOUT=*                                                  
//SYSIN    DD *                                                         