//KC03CAB2 JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID         
//*
//***********************************************                       
//*   COMPILADOR COBOL/DB2 BATCH                *                                     
//***********************************************                       
//*
//JCLLIB JCLLIB ORDER=KC02788.ALU9999.PROCLIB                           
//STEP1  EXEC COMPDB2,                                                  
//       ALUMLIB=KC03CAB.CURSOS,                                        
//       GOPGM='NOMBRE PGM COBOL CON SQL EMBEBIDO'                                               
//PC.SYSLIB  DD DSN=KC03CAB.CURSOS.DCLGEN,DISP=SHR                      
//COB.SYSLIB DD DSN=KC02788.ALU9999.COPYLIB,DISP=SHR                    