      ******************************************************************
       IDENTIFICATION DIVISION.                                         
      ******************************************************************
                                                                        
       PROGRAM-ID. PGMBACAB.                                            
      *    AUTHOR.        MATIAS N. MAZZITELLI | KC03CAB                
      *    DATE-WRITTEN.  2025-AGOSTO-09                                
                                                                        
      *----------------------------------------------------------------*
      *     ACTIVIDAD CLASE SINCRONICA 35 | SEND TEXTO EN CICS         *
      *----------------------------------------------------------------*
                                                                        
      *----------------------------------------------------------------*
      * ESTE PROGRAMA REALIZA EL ENVIO DE TEXTO A LA TERMINAL MEDIANTE *
      * CICS. ES EL PRIMER PGM REALIZADO POR EL ALUMNO LUEGO DE VER LA *
      * TEORIA DEL TEMA.                                               *
      *----------------------------------------------------------------*
                                                                        
      ******************************************************************
       DATA DIVISION.                                                   
      ******************************************************************
                                                                        
      *----------------------------------------------------------------*
       FILE SECTION.                                                    
      *----------------------------------------------------------------*
                                                                        
      *----------------------------------------------------------------*
       WORKING-STORAGE SECTION.                                         
      *----------------------------------------------------------------*
                                                                        
       01 WS-VARIABLES.                                                 
           02 WS-MENS                        PIC  X(14).                
           02 WS-TERMINAL                    PIC  X(04).                
           02 WS-LONG                        PIC S9(04) COMP.           
                                                                        
      *----------------------------------------------------------------*
       PROCEDURE DIVISION.                                              
      *----------------------------------------------------------------*
                                                                        
           PERFORM 1000-INICIO                                          
              THRU 1000-F-INICIO.                                       
                                                                        
           PERFORM 2000-PROCESO                                         
              THRU 2000-F-PROCESO.                                      
                                                                        
           PERFORM 3000-FIN                                             
              THRU 3000-F-FIN.                                          
                                                                        
      *----------------------------------------------------------------*
      *                     1 0 0 0 - I N I C I O                      *
      *----------------------------------------------------------------*
                                                                        
       1000-INICIO.                                                     
                                                                        
           INITIALIZE WS-VARIABLES.                                     
                                                                        
           MOVE 'HOLA CICS!!!!!'  TO WS-MENS.                           
           MOVE LENGTH OF WS-MENS TO WS-LONG.                           
                                                                        
       1000-F-INICIO.                                                   
           EXIT.                                                        
                                                                        
      *----------------------------------------------------------------*
      *                     2 0 0 0 - P R O C E S O                    *
      *----------------------------------------------------------------*
                                                                        
       2000-PROCESO.                                                    
                                                                        
           EXEC CICS                                                    
                SEND TEXT                                               
                FROM  (WS-MENS)                                         
                LENGTH(WS-LONG)                                         
                ERASE                                                   
           END-EXEC.                                                    
                                                                        
       2000-F-PROCESO.                                                  
           EXIT.                                                        
                                                                        
      *----------------------------------------------------------------*
      *                       3 0 0 0 - F I N                          *
      *----------------------------------------------------------------*
                                                                        
       3000-FIN.                                                        
                                                                        
           EXEC CICS                                                    
                RETURN                                                  
           END-EXEC.                                                    
                                                                       
       3000-F-FIN.                                                      
           EXIT.                                                        